# SetCDATA

## Description
Sets CDATA section.

```pascal
FUNCTION SetCDATA(
				XMLHandle   : LONGINT;
				elementPath : DYNARRAY[] of CHAR;
				data        : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.SetCDATA(XMLHandle, elementPath, data):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|elementPath|DYNARRAY[] of CHAR||
|data|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML